app/controllers/wines_controller.rb

  def index
  #@wines = Wine.all
  @available_at = Time.now
  @wines = Wine.order(:name).page(params[:page])
---
SELECT "wines".* FROM "wines" ORDER BY "wines"."name" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "wines"

def show
	@wines = Wine.find(params[:id])
---
SELECT "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", "1"]]

def create
	@wines = Wine.new(wine_params)
	#@wines.save
	#redirect_to @wines
	if @wines.save
---
INSERT INTO "wines" ("country", "created_at", "name", "updated_at", "varietal", "winery") VALUES (?, ?, ?, ?, ?, ?)  [["country", ""], ["created_at", Sat, 26 Apr 2014 16:08:59 UTC +00:00], ["name", ""], ["updated_at", Sat, 26 Apr 2014 16:08:59 UTC +00:00], ["varietal", ""], ["winery", ""]]

def destroy
	@wines = Wine.find(params[:id])
	@wines.destroy
---
SELECT "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "wines" WHERE "wines"."id" = ?  [["id", 4]]

def edit
	@wines = Wine.find(params[:id])
---
SELECT "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", "3"]]

def update
	@wines = Wine.find(params[:id])
	#@wines.update(wine_params)
	#redirect_to @wines
	if @wines.update(wine_params)
---
SELECT "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "wines" SET "varietal" = ?, "updated_at" = ? WHERE "wines"."id" = 15  [["varietal", "Red Wine"], ["updated_at", Sun, 27 Apr 2014 21:15:28 UTC +00:00]]